## Staging: heartbeat
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`





```terraform
Plan: 7 to add, 0 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_api_gateway_account.heartbeat_cloudwatch will be created
  + resource "aws_api_gateway_account" "heartbeat_cloudwatch" {
      + cloudwatch_role_arn = (known after apply)
      + id                  = (known after apply)
      + throttle_settings   = (known after apply)
    }

  # aws_cloudwatch_log_group.heartbeat_log_group will be created
  + resource "aws_cloudwatch_log_group" "heartbeat_log_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "heartbeat_log_group"
      + retention_in_days = 90
      + tags              = {
          + "Application" = "lambda"
          + "CostCenter"  = "notification-canada-ca-staging"
          + "Environment" = "staging"
        }
      + tags_all          = {
          + "Application" = "lambda"
          + "CostCenter"  = "notification-canada-ca-staging"
          + "Environment" = "staging"
        }
    }

  # aws_cloudwatch_log_metric_filter.heartbeat-500-errors-api will be created
  + resource "aws_cloudwatch_log_metric_filter" "heartbeat-500-errors-api" {
      + id             = (known after apply)
      + log_group_name = "/aws/lambda/heartbeat"
      + name           = "heartbeat-500-errors-api"
      + pattern        = "\"\\\"levelname\\\": \\\"ERROR\\\"\""

      + metric_transformation {
          + name      = "500-errors-heartbeat-api"
          + namespace = "LogMetrics"
          + unit      = "None"
          + value     = "1"
        }
    }

  # aws_cloudwatch_metric_alarm.logs-1-500-error-1-minute-warning-heartbeat-api will be created
  + resource "aws_cloudwatch_metric_alarm" "logs-1-500-error-1-minute-warning-heartbeat-api" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + alarm_description                     = "One 500 error in 1 minute for heartbeat api"
      + alarm_name                            = "logs-1-500-error-1-minute-warning-heartbeat-api"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "500-errors-heartbeat-api"
      + namespace                             = "LogMetrics"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 1
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.logs-10-500-error-5-minutes-critical-heartbeat-api will be created
  + resource "aws_cloudwatch_metric_alarm" "logs-10-500-error-5-minutes-critical-heartbeat-api" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-critical",
        ]
      + alarm_description                     = "Ten 500 errors in 5 minutes for heartbeat api"
      + alarm_name                            = "logs-10-500-error-5-minutes-critical-heartbeat-api"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "500-errors-heartbeat-api"
      + namespace                             = "LogMetrics"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-critical",
        ]
      + period                                = 300
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 10
      + treat_missing_data                    = "notBreaching"
    }

  # aws_iam_role.heartbeat_cloudwatch will be created
  + resource "aws_iam_role" "heartbeat_cloudwatch" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "apigateway.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "HeartbeatCloudWatchRole"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy_attachment.heartbeat_cloudwatch will be created
  + resource "aws_iam_role_policy_attachment" "heartbeat_cloudwatch" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonAPIGatewayPushToCloudWatchLogs"
      + role       = "HeartbeatCloudWatchRole"
    }

Plan: 7 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

This plan was saved to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"


```

</details>